In [2]:
import pandas as pd

Любым удобным для вас способом создайте dataframe c именем my_data, в котором две колонки c именами (type - строки, value - целые числа) и четыре наблюдения в каждой колонке:

In [7]:
data = {'type': ['A', 'A', 'B', 'B'], 'value': [10, 14, 12, 23]}
my_data = pd.DataFrame(data=data)
my_data

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

В переменную с именем subset_1 сохраните только первые 10 строк и только 1 и 3 колонку.
В переменную с именем subset_2 сохраните все строки кроме 1 и 5 и только 2 и 4 колонку.

In [20]:
my_data = pd.read_csv('datasets/my_stat.csv')

In [19]:
subset_1 = my_data.iloc[:10, [0, 2]]

In [18]:
subset_2 = my_data.iloc[:,[1, 3]].drop([0, 4], axis=0)

В переменную subset_1 сохраните только те наблюдения, у которых значения переменной V1  строго больше 0, и значение переменной V3  равняется 'A'.

В переменную  subset_2  сохраните только те наблюдения, у которых значения переменной V2  не равняются 10, или значения переменной V4 больше или равно 1.

In [24]:
subset_1 = my_data.query("V1 > 0 & V3 == 'A'")

In [23]:
subset_2 = my_data.query("V2 != 10 | V4 >= 1")

В данных (my_stat) создайте две новые переменных:

V5 = V1 + V4

V6 = натуральный логарифм переменной V2

In [26]:
import numpy as np
my_data['V5'] = my_data.V1 + my_data.V4
my_data['V6'] = np.log(my_data.V2)
my_data

     V1    V2 V3   V4   V5        V6
0     2  13.0  B  1.0  3.0  2.564949
1    -1   7.0  B  1.0  0.0  1.945910
2     0  11.0  A  0.0  0.0  2.397895
3     2  11.0  A  2.0  4.0  2.397895
4     0  10.0  B -1.0 -1.0  2.302585
..   ..   ... ..  ...  ...       ...
495   1   8.0  A -1.0  0.0  2.079442
496   3   8.0  A  1.0  4.0  2.079442
497  -1  11.0  B  2.0  1.0  2.397895
498   1  11.0  A  2.0  3.0  2.397895
499   0   8.0  B  1.0  1.0  2.079442

[500 rows x 6 columns]

Переименуйте колонки в данных  my_stat следующим образом:

V1 -> session_value

V2 -> group

V3 -> time

V4 -> n_users

In [31]:
my_data = my_data.rename(columns={'V1':'session_value', 'V2':'group', 'V3': 'time', 'V4': 'n_users'})

In [32]:
my_data

     session_value  group time  n_users   V5        V6
0                2   13.0    B      1.0  3.0  2.564949
1               -1    7.0    B      1.0  0.0  1.945910
2                0   11.0    A      0.0  0.0  2.397895
3                2   11.0    A      2.0  4.0  2.397895
4                0   10.0    B     -1.0 -1.0  2.302585
..             ...    ...  ...      ...  ...       ...
495              1    8.0    A     -1.0  0.0  2.079442
496              3    8.0    A      1.0  4.0  2.079442
497             -1   11.0    B      2.0  1.0  2.397895
498              1   11.0    A      2.0  3.0  2.397895
499              0    8.0    B      1.0  1.0  2.079442

[500 rows x 6 columns]

В переменной session_value замените все пропущенные значения на нули.

В переменной n_users замените все отрицательные значения на медианное значение переменной n_users (без учета отрицательных значений, разумеется).

In [64]:
my_stat = pd.read_csv('datasets/my_stat_1.csv')
my_stat = my_stat.fillna(0)

my_stat_new = my_stat.query('n_users >= 0')
median_users = my_stat_new['n_users'].median()
print(median_users)
my_stat.loc[my_stat.n_users < 0.0, 'n_users'] = median_users

my_stat

8.0

    session_value  time group  n_users
0             0.0     8     A       18
1             0.0     8     A        8
2             0.0     9     B       13
3             0.0     8     B        8
4             1.0    11     A        8
5            -2.0     8     A        8
6             0.0    10     A       14
7             1.0     9     A        8
8            -2.0    11     B        8
9            -1.0     8     B       11
10           -1.0    11     A       11
11           -1.0    10     B        0
12            0.0     9     A        5
13            0.0    10     A        6
14           -2.0    11     A        8
15            2.0     9     A        0
16           -1.0     9     B        8
17            2.0     7     B        8
18            2.0     9     B        8
19            1.0     9     B        0

В этой задаче для данных my_stat рассчитайте среднее значение переменной session_value для каждой группы (переменная group), в получившемся dataframe  переменная group не должна превратиться в индекс. Также переименуйте колонку со средним значением session_value в mean_session_value.

Получившийся результат сохраните в dataframe с именем mean_session_value_data.

In [74]:
mean_session_value_data = my_stat.groupby('group',as_index=False).aggregate({'session_value':'mean'}).rename(columns={'session_value':'mean_session_value'})
mean_session_value_data

  group  mean_session_value
0     A           -0.090909
1     B            0.000000